#include <iostream>
using namespace std;

/*
    &  有0必0
	&& 有假必假
*/

int main() {
	//1.位与运算符的定义
	int a = 0b1010;   //10
	int b = 0b0110;   //6
	//      0b0010;   //2
	cout << (a & b) << endl;
	cout << "---" << endl;

	//2.奇偶性
	cout << 5 % 2 << endl;   // % 优先级高、效率高
	cout << (5 & 1) << endl;   // & 优先级低、效率高
	//    0b0101
	//    0b0001
	cout << "---" << endl;

	//3.获取一个数二进制的末5位
	int c = 0b100111010101011; //后五位 01011
	cout << (c & 0b11111) << endl;
	cout << "---" << endl;

	//4.将末5位归零
	int d = 0b11111111111111111111111111100000;
	cout << (c & d) << endl;//0b100111010100000
	cout << "---" << endl;

	//5.消除末尾连续的1
	int e = 0b10101011111;
	// e+1= 0b10101100000;
	//  & = 0b10101000000;
	cout << (e & (e + 1)) << endl;
	cout << "---" << endl;

	//6.2的幂判定
	int f = 0b1000000000;
	// f-1= 0b0111111111;
	//  & = 0b0000000000 = 0;
	cout << ((f > 0) && ((f & (f - 1)) == 0)) << endl;



	return 0;
}